{
    "1, Python developer": {
        "vacancy_title": "Python developer",
        "vacancy_salary": null,
        "vacancy_city": "Москва",
        "vacancy_company": "UBIC",
        "vacancy_link": "https://spb.hh.ru/vacancy/91676650?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "Компания UBIC Technologies - создана в 2007 году и является разработчиком передовых инфраструктурных решений на основе конфиденциальных вычислений и машинного обучения. Данные решения нашли своё применение в госсекторе, банковской сфере, телекомах и маркетинге. Компания накопила значительные компетенции в области обработки и анализа больших данных, SmartCity, телекоммуникаций и финтеха. Мы создаем B2C, B2B и B2G продукты, используя широкий стек современных технологий. Проект: Основной проект — платформа совместных безопасных вычислений, которая проводит скоринг клиентов банков для оценки кредитного рейтинга. - Программирование распределенных вычислений; - Участие в R&D, то есть решение задач, которые до нас еще не решали; - Участие в разработке архитектурных решений; - Участие в кодревью; - Написание тестов Наш Стек:Python 3, FastAPI, Docker, Docker-compose, pytest, PostgreSQL, Redis Мы ждем: - От 3 года опыта разработки на python; - Понимание принципов Python-разработки; - Опыт с SQL/NoSQL базами данных, с docker; - Опыт с любым REST-фреймворком; - Знакомы со стандартными инструментами под классические задачи (очереди задач, базы данных, кеш, реверс-прокси, load-balancer, и т.д.); - Хорошее знание общих вопросов программирования: паттерны проектирования, структуры данных, классические алгоритмы; - Понимаете ĸаĸ работает асинхронность; - Не боитесь зайти на сервер и развернуть руками свой код Будет плюсом: - Опыт работы с микросервисной архитектурой; - Опыт работы с CI/CD на проекте, опыт работы с инфраструктурой (например, bash) - Опыт работы с Django/drf Мы предлагаем:  Оформление в соответствии с ТК РФ и полностью «белый» доход; Работа в аккредитованной ИТ компании; Конкурентный уровень заработной платы - мы высоко оцениваем любой вклад в развитие наших проектов; Комфортный график работы удаленно/гибрид/в офисе с гибким началом рабочего дня (офис Мск, м. Новокузнецкая/Третьяковская); Оборудование на выбор: Windows, Linux или Maс. Ноутбук или стационарный компьютер и любое разумное число мониторов; Занятия английским языком за счет компании; Возможность оплаты профессиональных курсов и повышения квалификации; Правильный отдых. Например, новогодний корпоратив 2019/2020 был в Иордании, осень 2020/2021 встречали в Сербии, весна 2023 были в Омане, грандиозные планы на 2024 год; Душевные посиделки в офисе (у нас есть приставки и настольный теннис во дворе)."
    },
    "2, Senior Python developer": {
        "vacancy_title": "Senior Python developer",
        "vacancy_salary": "до 250 000 ₽",
        "vacancy_city": "Санкт-Петербург",
        "vacancy_company": "ООО МедиаСофт",
        "vacancy_link": "https://spb.hh.ru/vacancy/86531354?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "Привет, мы — MediaSoft.team! Мы разрабатываем сложные веб-системы, бэкенды, мобильные приложения и highload-проекты для бизнеса с 2014 года. У нас в команде 300+ разработчиков по направлениям backend, frontend, mobile, qa и аналитика. Наши офисы находятся в Самаре, Ульяновске, Санкт-Петербурге, Москве, Ростове-на-дону (FIRECODE), Пензе (ZenCode) и Владимире (Hawking Bros). У нас точно хватит задач, которые покажутся тебе интересными. А в коллективе точно найдутся эксперты, которые знают больше. Мы предоставим тебе возможность развиваться в той области и писать на тех языках, которые тебе нравятся. Чтобы было понятнее, какие задачи решаются нашей командой, на сайте mediasoft.team есть кейсы с Хабра. Мы уверены, что ты каждый день работаешь с ООП, принципами SOLID, паттернами проектирования, Python 2.7/3+ или Go, SQL и системами контроля версий. Здорово, если ты знаешь:  Django, Flask, Tornado, Celery, Django Rest Framework, RabbitMQ, Redis, PostgreSQL, Docker, unittest, doctest, mock; Любой другой язык программирования; Как разбираться в чужом коде и вносить в него изменения, работать с легаси.  И еще лучше, если ты можешь и хочешь участвовать в выстраивании процессов, проводить Code Review и быть наставником. От нас:   Аккредитованная it-компания.    Оформление по ТК.   Пересмотр зарплаты и возможность роста.   Компенсация затрат на здоровье, внешнее обучение и спорт.   Гибкий график — учитываем режим сов, жаворонков, интровертов и социофобов.   Техника на любой платформе на рабочем месте.   Мерч — одеваем с ног до головы в корпоративную одежду и дарим подарки детям сотрудников.   Комфортная рабочая среда:   Работаем и общаемся в уютном офисе с зонами отдыха и спорта, кикером, настолками (нет полной удаленки, мы за живое общение, но с гибким подходом в формате гибрида без четкого графика).   Грамотно управляем: руководители компании — разработчики, они знают, как построить эффективные и удобные рабочие процессы.   Даем возможность работать с технологиями, которые интересны разработчику.   Обучаем команду: проводим образовательные лекции и мастер-классы по технологиям, поддерживаем библиотеку с технической литературой.   Любим хорошо отдохнуть: громко шумим два раза в год на наших корпоративах и регулярно собираемся вместе в офисе или на турбазе, в боулинге, баре.   Открыты к идеям, предложениям и творческим порывам.   Мы рады тем, кто разделяет наши ценности и хочет стать частью команды.Давайте работать вместе!"
    },
    "3, Middle Python/Go разработчик": {
        "vacancy_title": "Middle Python/Go разработчик",
        "vacancy_salary": "100 000 – 150 000 ₽",
        "vacancy_city": "Москва",
        "vacancy_company": "amoCRM",
        "vacancy_link": "https://spb.hh.ru/vacancy/93218101?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "amoCRM - крупнейшая CRM система в России. Мы помогаем сотням тысяч компаний оказывать лучший сервис для своих клиентов. Мы делаем это в России, США, Европе, Латинской Америке, общаемся с нашими клиентами на 4 языках. Мы помогаем им узнавать и обращаться к своим клиентам по имени, помогаем отвечать на сообщения быстрее, не забывать про встречи или просто отвечать на почту. А на самом деле amoCRM - это команда из молодых и скромных ребят, которым важно зачем они делают свою работу. Мы ищем к себе в команду Middle Python разработчика на внутренний проект по автоматизации, который хотел бы работать и развиваться вместе с нами. Обязанности:  Технически развивать проект; Создание мониторингов; Написание автоматизации для решения инцидентов в highload проекте; Работа с бекапами; Анализировать и оптимизировать узкие места системы; Автоматизация работы отделов; Решение аварий; Нести полную ответственность за свой код; Review кода. Наш стек: Python, Go, Docker, Kubernetes, Django, Redis, Celery, MySQL, Git, Linux, Makefile и Shell скрипты, Vue, Jenkins.  Будет преимуществом, если вы: Имеете более 1 года коммерческой разработки;    Умеете структурно мыслить, а также умеете разбивать проект на подзадачи;   Работали с другими языками программирования, например php;   Ответственный, самостоятельный, организованный; Стремитесь учиться и развиваться. Мы предлагаем:  Работа над интересным проектом в технически сильной команде;  Возможность карьерного и профессионального роста; Комфортный офис в шаговой доступности от м.Таганская (работа в московском офисе); Без бюрократии, дресс-кода. Печенки, чай, кофе;   График 5/2 с 10:00 до 19:00 или с 11:00 до 20:00 Мск; Работа в офисе, без возможности удаленной работы. Факты о проекте:  Мониторинг состояния более 500 шадр и сервисов;  Обслуживание шард (оптимайз, решардинг, аналайз); Перевод трафика по DNS; Обращение к базе данных без прямого подключения к доступам;   Оповещения об авариях и автоматическое решение."
    },
    "4, Руководитель группы разработки (Python, backend)": {
        "vacancy_title": "Руководитель группы разработки (Python, backend)",
        "vacancy_salary": null,
        "vacancy_city": "Москва",
        "vacancy_company": "SL Soft",
        "vacancy_link": "https://spb.hh.ru/vacancy/91311746?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "В настоящий момент мы ищем тимлида в команду разработки Polymatica ML - это уникальное решение, созданное с учётом лучших мировых практик, которое обеспечивает полный цикл работы с моделями машинного обучения.   Чем нужно будет заниматься:  Разрабатывать продукт совместно с командой; Обеспечивать прозрачность работы в курируемой команде; Согласовывать технические решения; Улучшать метрики команды (Time to Market, Cycle Time и пр.); Развивать и мотивировать сотрудников, быть для них лидером и наставником (1:1, ИПР, Performance Review); Налаживать отношения со специалистами смежных команд/проектов внедрения.  Нам бы хотелось увидеть у кандидата:  Опыт работы на аналогичной позиции от 3-х лет; Опыт руководства командой разработки от 4-х человек, Понимание преимущества гибких методологий разработки и положительный опыт применения на практике; Умение управлять своими задачами и задачами подчиненных; Опыт подбора сотрудников.  Технические навыки:  Restful API (Fastapi); dask, celery, sqlalchemy; Веб-фреймворки (aiohttp/fastAPI/flask/Django); Асинхронное программирование, работа с микросервисной архитектурой; Опыт разработки многопоточных приложений; Опыт разработки распределенных приложений; Понимание работы с Docker и среды контейнеризации (Kubernetes, OpenShift); Опыт с Kubernetes API, Kaniko; Знание принципов работы очередей сообщений (RabbitMQ, ActiveMQ, Apache Kafka); Опыт работы с PostgreSQL, ClickHouse; Опыт разработки и поддержки CI/CD ( Ansible, Jenkins, Gitlab CI); Подготовка документации, инструкций, сборка дистрибутивов.  Будет дополнительным плюсом:  Понимание основ машинного обучения, включая алгоритмы обучения моделей, методы оптимизации и оценки качества моделей; Опыт работы с фреймворками и библиотеками машинного обучения, такими как TensorFlow, PyTorch, scikit-learn, и другими; Понимание принципов обработки данных, включая предварительную обработку, выравнивание, и представление данных для обучения моделей.  Мы готовы предложить:  Мы готовы обсуждать условия дохода с каждым кандидатом индивидуально по итогам собеседования; График работы 5/2 (гибридный или удаленный формат), есть возможность индивидуального графика; Комфортный и современный офис в Москве, удобно расположенный в деловом квартале \"Новоспасский\" (м. Пролетарская, м. Павелецкая)."
    },
    "5, Middle / Senior Python Developer (удаленно)": {
        "vacancy_title": "Middle / Senior Python Developer (удаленно)",
        "vacancy_salary": null,
        "vacancy_city": "Санкт-Петербург",
        "vacancy_company": "RedLab",
        "vacancy_link": "https://spb.hh.ru/vacancy/92896866?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "RedLab — глобальная IT-компания, которая занимается разработкой ПО, а также предоставляет услуги аутстаффинга и аутсорсинга. Мы входим в группу компаний Litota Group c 2019 года и объединяем более 200 экспертов из 11 стран. Предлагаем:  полную занятость со стабильными выплатами; оплату труда, соответствующую вашим навыкам и ожиданиям, с реальной возможностью роста; разнообразные трендовые проекты, в том числе, международного уровня; полностью удаленный формат работы; стабильный график 5/2 с гибким началом рабочего дня; отличные бонусы для тех, кто работает год и более.  Ожидаем:   Опыт коммерческой разработки на Python от 3-х лет; Владение одним из асинхронных фреймворком: FastAPI, AioHttp. Опыт работы с asyncio, threading. Будет плюсом владение фреймворками: Sanic, Starlette,Django, Flask, etc.; Опыт работы с БД (PostgreSQL/Oracle); Опыт работы с брокерами очередей; Опыт разработки API (RestAPI); Опыт написания SQL-запросов; Опыт работы с микросервисной архитектурой; Опыт работы с Git, Jira; Коммуникабельность, умение продуктивно общаться с коллегами.  Будет плюсом:   Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes; Опыт работы с Keycloak; NoSQL (Clickhouse, Mongo, InfluxDB).  Ждем Вас в нашей команде!"
    },
    "6, Python developer": {
        "vacancy_title": "Python developer",
        "vacancy_salary": null,
        "vacancy_city": "Санкт-Петербург",
        "vacancy_company": "BLACKHUB GAMES",
        "vacancy_link": "https://spb.hh.ru/vacancy/94293381?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "Привет!Мы - команда BLACKHUB Games, и сейчас мы находимся в поиске человека, который будет автоматизировать внутренние процессы разработки веб-сервисов для нашей сетевой мобильной игры BLACK RUSSIA, в которую ежедневно заходят более 800.000 пользователей, а онлайн в моменте составляет 90.000. Стремимся к постоянному развитию, проходя различные обучения и выполняя интересные задачи. Ошибок не боимся - они помогают развиваться. Ну и, само собой, мы предпочитаем заниматься любимым делом, получая кайф от проделанной работы и результата! Примеры задач, которые предстоит решать в ближайшем будущем:   Создание и поддержка web-сервисов для упрощения администрирования парка игровых серверов компании;   Оценка входящих задач и соблюдение сроков выполнения;   Участие в выборе технических решений;   Проведение кода-ревью коллег.   Необходимые навыки:   Опыт коммерческой разработки от 2х лет;   Знания Python, Django, DRF, FastAPI, SQL;   Знание и понимание принципов ООП, SOLID, KISS, DRY, REST;   Опыт написания тестов (pytest/unittest);   Опыт командной разработки с использованием Git;   Опыт работы с ОС Linux.   Наше предложение:   Официальное трудоустройство и полностью белая ЗП - гарантируем надежность и стабильность!  Лояльно относимся к любому формату работы - удаленка, гибрид или офис в историческом центре Санкт-Петербурга!  Гибкий график работы, лояльное руководство - индивидуально подходим к каждому!   Компенсация обедов для сотрудников офиса - заботимся о наших сотрудниках!   Возможность для обучения за счет компании - постоянное развитие!   Насыщенная и веселая корпоративная жизнь - шумно отмечаем наши успехи!   Возможность премирования и пересмотра заработной платы - расти в доходе вместе с компанией!   Корпоративная валюта - конвертируй свои успехи и достижения еще и в BlackCoins!   ДМС со стоматологией после прохождения испытательного срока - обслуживание в лучших клиниках города!   *Размер заработной платы обсуждается с каждым кандидатом индивидуально (!)"
    },
    "7, Senior Backend Python/Django разработчик (Гибрид)": {
        "vacancy_title": "Senior Backend Python/Django разработчик (Гибрид)",
        "vacancy_salary": null,
        "vacancy_city": "Москва",
        "vacancy_company": "ЧУ ДО Московская школа программистов",
        "vacancy_link": "https://spb.hh.ru/vacancy/91884517?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "Приглашаем присоединиться к команде Школы программистов. Школа обучает детей на собственной LMS: наша платформа автоматизирует образовательные процессы от поступления до выдачи выпускного свидетельства. Мы научили программированию уже 100 000 учеников. Сейчас мы расширяем команду и ищем Senior Backend Python/Django разработчика. Что нужно будет делать:   Разрабатывать новую функциональность на Python/Django и асинхронных фреймворках;   Поддерживать существующую логику, переносить на сервисную архитектуру;   Писать unit-тесты;   Проводить код ревью;   Грумить задачи с менеджерами, оценивать трудозатраты;   Формализовывать, расписывать задачи для разработчиков;   Прорабатывать архитектурные решения;   Что нужно уметь:   Писать простой, чистый код;   Осознанно применять ООП и паттерны;   Быстро разбираться в чужом коде;   Ориентироваться в бизнес логике и сценариях;   Предлагать различные варианты решения проблем;   Разрабатывать сервисы на Django + drf;   Писать идемпотентные задачи на Celery, Rabbitmq;   Писать эффективные Dockerfile;   Писать protobuf файлы, делать grpc вызовы:   Профилировать запросы к Mysql/PostgreSQL;   Писать простые скрипты на bash.   Будем очень рады, если ты:   Знаешь или хочешь писать на golang;   Разрабатывал сервис-ориентированные архитектуры;   Работал с docker-compose, ansible, terraform, k8s;   Работал с брокерами сообщений: Nats, Apache Kafka;   Работал с nosql: redis, elasticsearch, clickhouse, mongo;   Мы рады предложить тебе:   Оформление в аккредитованную It-компанию, по ТК с первого рабочего дня;   ДМС после прохождения испытательного срока;   Профессиональный рост, систему грейдов с переоценкой уровня каждые полгода;   Работу в коллективе с неформальным стилем общения;   Минимум совещаний и митингов;   Гибкое начало рабочего дня, можно начинать работать с 9:00, 10:00 или c 11:00;   Гибридный формат работы, 70/30 офис/удаленка;   Оплачиваемый отпуск 28 дней в год;   В нашей компании предусмотрены следующие этапы подбора:  Скрининг интервью;  Ревью примеров вашего кода или тестовое задание;  Техническое собеседование 1 час, без лайф-кодинга; Знакомство с СТО; Оффер."
    },
    "8, Python разработчик": {
        "vacancy_title": "Python разработчик",
        "vacancy_salary": "250 000 – 350 000 ₽",
        "vacancy_city": "Москва",
        "vacancy_company": "Sapiens solutions",
        "vacancy_link": "https://spb.hh.ru/vacancy/91187726?query=python&hhtmFrom=vacancy_search_list",
        "vacancy_text": "Sapiens Solutions - команда экспертов, специализирующаяся на разработке решений в области хранилищ данных, аналитической отчетности, мобильных приложений, системах планирования и прогнозирования. Опыт команды и её безупречная репутация - гарантия успешного сотрудничества с нашими клиентами. «Мы ценим красивые технические решения и создаем приложения, которыми пользуются». Мы предлагаем участие в проектах по реализации корпоративной системы распределения расходов на open-source решениях: Postgres, Clickhouse, Airflow, Superset, JS/Python (пилотная функциональность). Что Вам предстоит делать?  Реализация бэкенд логики корпоративных систем: управление, ввод данных, аналитический движок (доработка Apache Superset). Доработка опен-сорс проекта Apache Superset.  Требование:   Опыт разработки Python от 3х лет Опыт работы с Flask Хорошие знания SQL  Что мы Вам предлагаем?  Комбинированный (офис/дом) или полностью дистанционный формат работы (только на территории РФ); Оформление согласно ТК. Также оформление по договору ИП. Стабильный и прозрачный доход: зарплата и премии по результатам работы; Программа ДМС, включая стоматологию Обучение и сертификация; Корпоративные мероприятия для наших сотрудников (спортивные, team-building, развлекательные)."
    }
}